spec/fixtures/vcr_cassettes/ogone/visa_payment_2000_credit_card.yml

--- 
- !ruby/struct:VCR::HTTPInteraction 
  request: !ruby/struct:VCR::Request 
    method: :post
    uri: https://secure.ogone.com:443/ncol/test/orderdirect.asp
    body: orderID=99075&COM=SublimeVideo+Invoices%3A+%232lieijf6%2C+%23fwli65rj&ALIAS=tpptrkri&FLAG3D=Y&WIN3DS=MAINW&HTTP_ACCEPT=%2A%2F%2A&PARAMPLUS=PAYMENT%3DTRUE%26ACTION%3D&CN=John+Doe+Huber&CARDNO=4111111111111111&ED=0312&CVC=111&OwnerZip=2000&ownercty=CH&EMAIL=email1%40user.com&currency=USD&amount=20000&PSPID=jilion&USERID=sublime&PSWD=WWQMNC89&Operation=SAL&SHASign=EA566AF634DE16BF902E0A2E58AC02E94CDE6F0C12782407CF4F71D7B073CA18E1C30EF96E1F607A5AC010190630946F823CB02DFD35EE6F0EDECD17952A564A
    headers: 
      content-type: 
      - application/x-www-form-urlencoded
  response: !ruby/struct:VCR::Response 
    status: !ruby/struct:VCR::ResponseStatus 
      code: 200
      message: OK
    headers: 
      date: 
      - Sat, 19 Mar 2011 00:40:07 GMT
      server: 
      - Microsoft-IIS/6.0
      x-powered-by: 
      - ASP.NET
      content-length: 
      - "312"
      content-type: 
      - text/html
      cache-control: 
      - private
    body: |-
      <?xml version="1.0"?><ncresponse
      orderID="99075"
      PAYID="9683069"
      NCSTATUS="0"
      NCERROR="0"
      ACCEPTANCE="test123"
      STATUS="9"
      IPCTY="99"
      CCCTY="US"
      ECI="12"
      CVCCheck="NO"
      AAVCheck="NO"
      VC="NO"
      amount="200"
      currency="USD"
      PM="CreditCard"
      BRAND="VISA"
      ALIAS="tpptrkri"
      NCERRORPLUS="!">
      </ncresponse>
    http_version: "1.1"
